wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_ipa.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check for null pointer */
    if(NULL == foreground_struct) {
        fw_debug_report_err(IPA_MODULE_ID, API_ID(0x000DU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* foreground memory base address configuration */
        IPA_FMADDR &= ~(IPA_FMADDR_FMADDR);
        IPA_FMADDR = foreground_struct->foreground_memaddr;
        /* foreground line offset configuration */
        IPA_FLOFF &= ~(IPA_FLOFF_FLOFF);
        IPA_FLOFF = foreground_struct->foreground_lineoff;
        /* foreground pixel format pre-defined alpha, alpha calculation algorithm configuration */
        IPA_FPCTL &= ~(IPA_FPCTL_FPDAV | IPA_FPCTL_FAVCA | IPA_FPCTL_FPF | IPA_FPCTL_FIIMEN | IPA_FPCTL_YUVSWAP);
        IPA_FPCTL |= (foreground_struct->foreground_prealpha << 24U);
        IPA_FPCTL |= foreground_struct->foreground_alpha_algorithm & IPA_FPCTL_FAVCA;
        IPA_FPCTL |= foreground_struct->foreground_pf & IPA_FPCTL_FPF;
        if(ENABLE == foreground_struct->foreground_interlace_mode) {
            IPA_FPCTL |= IPA_FPCTL_FIIMEN;
        }
        /* foreground pre-defined red green blue configuration */
        IPA_FPV &= ~(IPA_FPV_FPDRV | IPA_FPV_FPDGV | IPA_FPV_FPDBV);
        IPA_FPV |= (((foreground_struct->foreground_prered << 16U) & IPA_FPV_FPDRV) | ((foreground_struct->foreground_pregreen << 8U) & IPA_FPV_FPDGV)
                    | (foreground_struct->foreground_preblue & IPA_FPV_FPDBV));
        /* foreground even frame / UV memory base address configuration */
        IPA_EF_UV_MADDR &= ~(IPA_EF_UV_MADDR_EFUVMADDR);
        IPA_EF_UV_MADDR = foreground_struct->foreground_efuv_memaddr;
    }

    if(SET == tempflag) {
        /* restore the state of TEN */
        IPA_CTL |= IPA_CTL_TEN;
    }
}

/*!
    \brief      initialize the structure of IPA background parameter struct with the default values, it is
                suggested that call this function after an ipa_background_parameter_struct structure is defined (API_ID(0x000EU))
    \param[in]  none
    \param[out] background_struct: the data needed to initialize background
    \retval     none
*/
void ipa_background_struct_para_init(ipa_background_parameter_struct *background_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check for null pointer */
    if(NULL == background_struct) {
        fw_debug_report_err(IPA_MODULE_ID, API_ID(0x000EU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the struct parameters with default values */
        background_struct->background_memaddr = IPA_DEFAULT_VALUE;
        background_struct->background_lineoff = IPA_DEFAULT_VALUE;
        background_struct->background_prealpha = IPA_DEFAULT_VALUE;
        background_struct->background_alpha_algorithm = IPA_BG_ALPHA_MODE_0;
        background_struct->background_pf = BACKGROUND_PPF_ARGB8888;
        background_struct->background_prered = IPA_DEFAULT_VALUE;
        background_struct->background_pregreen = IPA_DEFAULT_VALUE;
        background_struct->background_preblue = IPA_DEFAULT_VALUE;
    }
}

/*!
    \brief      initialize background parameters (API_ID(0x000FU))
    \param[in]  background_struct: the data needed to initialize background
                  background_memaddr: background memory base address
                  background_lineoff: background line offset
                  background_prealpha: background pre-defined alpha value
                  background_alpha_algorithm: IPA_BG_ALPHA_MODE_0, IPA_FG_ALPHA_MODE_1, IPA_FG_ALPHA_MODE_2
                  background_pf: background pixel format(BACKGROUND_PPF_ARGB8888, BACKGROUND_PPF_RGB888, BACKGROUND_PPF_RGB565,
                            BACKGROUND_PPF_ARGB1555, BACKGROUND_PPF_ARGB4444, BACKGROUND_PPF_L8, BACKGROUND_PPF_AL44,
                            BACKGROUND_PPF_AL88, BACKGROUND_PPF_L4, BACKGROUND_PPF_A8, BACKGROUND_PPF_A4)
                  background_prered: background pre-defined red value
                  background_pregreen: background pre-defined green value
                  background_preblue: background pre-defined blue value
    \param[out] none
    \retval     none
*/
void ipa_background_init(ipa_background_parameter_struct *background_struct)
{
    FlagStatus tempflag = RESET;
    if(RESET != (IPA_CTL & IPA_CTL_TEN)) {
        tempflag = SET;
        /* reset the TEN in order to configure the following bits */
        IPA_CTL &= ~IPA_CTL_TEN;
    }

#ifdef FW_DEBUG_ERR_REPORT
    /* check for null pointer */
    if(NULL == background_struct) {
        fw_debug_report_err(IPA_MODULE_ID, API_ID(0x000FU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* background memory base address configuration */
        IPA_BMADDR &= ~(IPA_BMADDR_BMADDR);
        IPA_BMADDR = background_struct->background_memaddr;
        /* background line offset configuration */
        IPA_BLOFF &= ~(IPA_BLOFF_BLOFF);
        IPA_BLOFF = background_struct->background_lineoff;
        /* background pixel format pre-defined alpha, alpha calculation algorithm configuration */
        IPA_BPCTL &= ~(IPA_BPCTL_BPDAV | IPA_BPCTL_BAVCA | IPA_BPCTL_BPF);
        IPA_BPCTL |= (background_struct->background_prealpha << 24U);
        IPA_BPCTL |= background_struct->background_alpha_algorithm & IPA_BPCTL_BAVCA;
        IPA_BPCTL |= background_struct->background_pf & IPA_BPCTL_BPF;
        /* background pre-defined red green blue configuration */
        IPA_BPV &= ~(IPA_BPV_BPDRV | IPA_BPV_BPDGV | IPA_BPV_BPDBV);
        IPA_BPV |= (((background_struct->background_prered << 16U) & IPA_BPV_BPDRV) | ((background_struct->background_pregreen << 8U) & IPA_BPV_BPDGV)
                    | (background_struct->background_preblue & IPA_BPV_BPDBV));
    }

    if(SET == tempflag) {
        /* restore the state of TEN */
        IPA_CTL |= IPA_CTL_TEN;
    }
}

/*!
    \brief      initialize the structure of IPA destination parameter struct with the default values, it is
                suggested that call this function after an ipa_destination_parameter_struct structure is defined (API_ID(0x0010U))
    \param[in]  none
    \param[out] destination_struct: the data needed to initialize destination parameter
    \retval     none
*/
void ipa_destination_struct_para_init(ipa_destination_parameter_struct *destination_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check for null pointer */
    if(NULL == destination_struct) {
        fw_debug_report_err(IPA_MODULE_ID, API_ID(0x0010U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the struct parameters with default values */
        destination_struct->destination_pf = IPA_DPF_ARGB8888;
        destination_struct->destination_lineoff = IPA_DEFAULT_VALUE;
        destination_struct->destination_prealpha = IPA_DEFAULT_VALUE;
        destination_struct->destination_prered = IPA_DEFAULT_VALUE;
        destination_struct->destination_pregreen = IPA_DEFAULT_VALUE;
        destination_struct->destination_preblue = IPA_DEFAULT_VALUE;
        destination_struct->destination_memaddr = IPA_DEFAULT_VALUE;
        destination_struct->image_width = IPA_DEFAULT_VALUE;
        destination_struct->image_height = IPA_DEFAULT_VALUE;
        destination_struct->image_rotate = DESTINATION_ROTATE_0;
        destination_struct->image_hor_decimation = DESTINATION_HORDECIMATE_DISABLE;
        destination_struct->image_ver_decimation = DESTINATION_VERDECIMATE_DISABLE;
        destination_struct->image_bilinear_xscale = IPA_DEFAULT_SCALE;
        destination_struct->image_bilinear_yscale = IPA_DEFAULT_SCALE;
        destination_struct->image_scaling_width = IPA_DEFAULT_VALUE;
        destination_struct->image_scaling_height = IPA_DEFAULT_VALUE;
    }
}

/*!
    \brief      initialize destination parameters (API_ID(0x0011U))
    \param[in]  destination_struct: the data needed to initialize destination parameters
                  destination_pf: IPA_DPF_ARGB8888, IPA_DPF_RGB888, IPA_DPF_RGB565, IPA_DPF_ARGB1555,
                                  IPA_DPF_ARGB4444, IPA_DPF_BGR888, IPA_DPF_BGR565, refer to ipa_dpf_enum
                  destination_lineoff: destination line offset
                  destination_prealpha: destination pre-defined alpha value
                  destination_prered: destination pre-defined red value
                  destination_pregreen: destination pre-defined green value
                  destination_preblue: destination pre-defined blue value
                  destination_memaddr: destination memory base address
                  image_width: width of the image to be processed
                  image_height: height of the image to be processed
                  image_rotate: DESTINATION_ROTATE_0, DESTINATION_ROTATE_90,
                                DESTINATION_ROTATE_180, DESTINATION_ROTATE_270
                  image_hor_decimation: DESTINATION_HORDECIMATE_DISABLE, DESTINATION_HORDECIMATE_2,
                                        DESTINATION_HORDECIMATE_4, DESTINATION_HORDECIMATE_8
                  image_ver_decimation: DESTINATION_VERDECIMATE_DISABLE, DESTINATION_VERDECIMATE_2,
                                        DESTINATION_VERDECIMATE_4, DESTINATION_VERDECIMATE_8
                  image_bilinear_xscale: x scaling factor
                  image_bilinear_yscale: y scaling factor
                  image_scaling_width: width of the image after scaling
                  image_scaling_height: height of the image after scaling
    \param[out] none
    \retval     none
*/
void ipa_destination_init(ipa_destination_parameter_struct *destination_struct)
{
    uint32_t destination_pixelformat;
    FlagStatus tempflag = RESET;
    if(RESET != (IPA_CTL & IPA_CTL_TEN)) {
        tempflag = SET;
        /* reset the TEN in order to configure the following bits */
        IPA_CTL &= ~IPA_CTL_TEN;
    }

