wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_ipa.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check for null pointer */
    if(NULL == destination_struct) {
        fw_debug_report_err(IPA_MODULE_ID, API_ID(0x0011U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* destination pixel format, interlace sampling method and rotation configuration */
        IPA_DPCTL = ((destination_struct->destination_pf & IPA_DPCTL_DPF) |
                     (destination_struct->image_rotate & IPA_DPCTL_ROT) |
                     (destination_struct->image_hor_decimation & IPA_DPCTL_HORDEC) |
                     (destination_struct->image_ver_decimation & IPA_DPCTL_VERDEC));
        destination_pixelformat = destination_struct->destination_pf;
        /* destination pixel format ARGB8888 */
        switch(destination_pixelformat) {
        case IPA_DPF_ARGB8888:
            IPA_DPV &= ~(IPA_DPV_DPDBV_0 | (IPA_DPV_DPDGV_0) | (IPA_DPV_DPDRV_0) | (IPA_DPV_DPDAV_0));
            IPA_DPV = ((destination_struct->destination_preblue & IPA_DPV_DPDBV_0) | ((destination_struct->destination_pregreen << 8U) & IPA_DPV_DPDGV_0)
                       | ((destination_struct->destination_prered << 16U) & IPA_DPV_DPDRV_0)
                       | ((destination_struct->destination_prealpha << 24U) & IPA_DPV_DPDAV_0));
            break;
        /* destination pixel format RGB888/BGR888 */
        case IPA_DPF_RGB888:
        case IPA_DPF_BGR888:
            IPA_DPV &= ~(IPA_DPV_DPDBV_1 | (IPA_DPV_DPDGV_1) | (IPA_DPV_DPDRV_1));
            IPA_DPV = ((destination_struct->destination_preblue & IPA_DPV_DPDBV_1) | ((destination_struct->destination_pregreen << 8U) & IPA_DPV_DPDGV_1)
                       | ((destination_struct->destination_prered << 16U) & IPA_DPV_DPDRV_1));
            break;
        /* destination pixel format RGB565/BGR565 */
        case IPA_DPF_RGB565:
        case IPA_DPF_BGR565:
            IPA_DPV &= ~(IPA_DPV_DPDBV_2 | (IPA_DPV_DPDGV_2) | (IPA_DPV_DPDRV_2));
            IPA_DPV = ((destination_struct->destination_preblue & IPA_DPV_DPDBV_2) | ((destination_struct->destination_pregreen << 5U) & IPA_DPV_DPDGV_2)
                       | ((destination_struct->destination_prered << 11U) & IPA_DPV_DPDRV_2));
            break;
        /* destination pixel format ARGB1555 */
        case IPA_DPF_ARGB1555:
            IPA_DPV &= ~(IPA_DPV_DPDBV_3 | (IPA_DPV_DPDGV_3) | (IPA_DPV_DPDRV_3) | (IPA_DPV_DPDAV_3));
            IPA_DPV = ((destination_struct->destination_preblue & IPA_DPV_DPDBV_3) | ((destination_struct->destination_pregreen << 5U) & IPA_DPV_DPDGV_3)
                       | ((destination_struct->destination_prered << 10U) & IPA_DPV_DPDRV_3)
                       | ((destination_struct->destination_prealpha << 15U) & IPA_DPV_DPDAV_3));
            break;
        /* destination pixel format ARGB4444 */
        case IPA_DPF_ARGB4444:
            IPA_DPV &= ~(IPA_DPV_DPDBV_4 | (IPA_DPV_DPDGV_4) | (IPA_DPV_DPDRV_4) | (IPA_DPV_DPDAV_4));
            IPA_DPV = ((destination_struct->destination_preblue & IPA_DPV_DPDBV_4) | ((destination_struct->destination_pregreen << 4U) & IPA_DPV_DPDGV_4)
                       | ((destination_struct->destination_prered << 8U) & IPA_DPV_DPDRV_4)
                       | ((destination_struct->destination_prealpha << 12U) & IPA_DPV_DPDAV_4));
            break;

        default:
            break;
        }
        /* destination memory base address configuration */
        IPA_DMADDR = destination_struct->destination_memaddr;
        /* destination line offset configuration */
        IPA_DLOFF = destination_struct->destination_lineoff & IPA_DLOFF_DLOFF;
        /* image size configuration */
        IPA_IMS &= ~(IPA_IMS_HEIGHT | IPA_IMS_WIDTH);
        IPA_IMS |= (((destination_struct->image_width << 16U) & IPA_IMS_WIDTH) | (destination_struct->image_height & IPA_IMS_HEIGHT));
        /* xscale and yscale configuration */
        IPA_BSCTL &= ~(IPA_BSCTL_XSCALE | IPA_BSCTL_YSCALE);
        IPA_BSCTL = ((destination_struct->image_bilinear_xscale & IPA_BSCTL_XSCALE) |
                     ((uint32_t)(destination_struct->image_bilinear_yscale << 16U) & IPA_BSCTL_YSCALE));
        /* image size after scaling configuration */
        IPA_DIMS &= ~(IPA_DIMS_DWIDTH | IPA_DIMS_DHEIGHT);
        IPA_DIMS = (destination_struct->image_scaling_height & IPA_DIMS_DHEIGHT) |
                   ((uint32_t)((destination_struct->image_scaling_width << 16U) & IPA_DIMS_DWIDTH));
    }

    if(SET == tempflag) {
        /* restore the state of TEN */
        IPA_CTL |= IPA_CTL_TEN;
    }
}

/*!
    \brief      initialize IPA foreground LUT parameters (API_ID(0x0012U))
    \param[in]  fg_lut_num: foreground LUT number of pixel
    \param[in]  fg_lut_pf: foreground LUT pixel format(IPA_LUT_PF_ARGB8888, IPA_LUT_PF_RGB888)
    \param[in]  fg_lut_addr: foreground LUT memory base address
    \param[out] none
    \retval     none
*/
void ipa_foreground_lut_init(uint8_t fg_lut_num, uint8_t fg_lut_pf, uint32_t fg_lut_addr)
{
    FlagStatus tempflag = RESET;
    if(RESET != (IPA_FPCTL & IPA_FPCTL_FLLEN)) {
        tempflag = SET;
        /* reset the FLLEN in order to configure the following bits */
        IPA_FPCTL &= ~IPA_FPCTL_FLLEN;
    }

    /* foreground LUT number of pixel configuration */
    IPA_FPCTL |= ((uint32_t)fg_lut_num << 8U);
    /* foreground LUT pixel format configuration */
    if(IPA_LUT_PF_RGB888 == fg_lut_pf) {
        IPA_FPCTL |= IPA_FPCTL_FLPF;
    } else if(IPA_LUT_PF_ARGB8888 == fg_lut_pf) {
        IPA_FPCTL &= ~(IPA_FPCTL_FLPF);
    } else {
    }
    /* foreground LUT memory base address configuration */
    IPA_FLMADDR = fg_lut_addr;

    if(SET == tempflag) {
        /* restore the state of FLLEN */
        IPA_FPCTL |= IPA_FPCTL_FLLEN;
    }
}

/*!
    \brief      initialize IPA background LUT parameters (API_ID(0x0013U))
    \param[in]  bg_lut_num: background LUT number of pixel
    \param[in]  bg_lut_pf: background LUT pixel format(IPA_LUT_PF_ARGB8888, IPA_LUT_PF_RGB888)
    \param[in]  bg_lut_addr: background LUT memory base address
    \param[out] none
    \retval     none
*/
void ipa_background_lut_init(uint8_t bg_lut_num, uint8_t bg_lut_pf, uint32_t bg_lut_addr)
{
    FlagStatus tempflag = RESET;
    if(RESET != (IPA_BPCTL & IPA_BPCTL_BLLEN)) {
        tempflag = SET;
        /* reset the BLLEN in order to configure the following bits */
        IPA_BPCTL &= ~IPA_BPCTL_BLLEN;
    }

    /* background LUT number of pixel configuration */
    IPA_BPCTL |= ((uint32_t)bg_lut_num << 8U);
    /* background LUT pixel format configuration */
    if(IPA_LUT_PF_RGB888 == bg_lut_pf) {
        IPA_BPCTL |= IPA_BPCTL_BLPF;
    } else if(IPA_LUT_PF_ARGB8888 == bg_lut_pf) {
        IPA_BPCTL &= ~(IPA_BPCTL_BLPF);
    } else {
    }
    /* background LUT memory base address configuration */
    IPA_BLMADDR = bg_lut_addr;

